Revit 2027 API
IFCParameterTemplate.IsValidParameterMappingFile Property
 Whether or not the parameter mapping file is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidParameterMappingFile { get; set; }
Public Property IsValidParameterMappingFile As Boolean
	Get
	Set
public:
property bool IsValidParameterMappingFile {
	bool get ();
	void set (bool value);
}
member IsValidParameterMappingFile : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace